// Как клиент, вы хотите программное обеспечение для управления адресами ваших клиентов, используя
// объектно-ориентированный подход и записи в Java.
// Вам не нужно хранить имена. Вы хотите возможность добавлять новые адреса, получать уведомление, если адрес 
// уже существует, и выполнять поиск по различным параметрам, возвращая результат в отсортированной форме. 
// Также требуется возможность форматировать каждый адрес, возможность предупреждения об ошибке введенного
// почтового индекса, и базовый класс для улицы или абонентского ящика с поддержкой различных типов адресов. 
// Каждая сущность адреса должна быть представлена отдельным объектом с соответствующими методами.

// Дополнительные требования включают в себя предупреждение об ошибке при неверном вводе почтового индекса, 
// создание базового класса для адреса, включая методы для сортировки и сравнения, использование 
// исключений при обнаружении дубликата адреса или отсутствии результатов поиска, а также использование 
// названий методов вроде find(Zipcode), find(City), find(Zipcode, City) для поиска.

// Также уточнения касаются добавления метода для сортировки или сравнения в класс адреса из-за абстракции 
// от конкретных значений.

// Последним пунктом требований является объяснение объектов и указание возможных преимуществ такой реализации.

class Main {
    public static void main(String[] args) {

    }
}